dirkwa/espos-p4-cockpit/sdkconfig.defaults
# espos-p4-cockpit — project defaults (ESP32-P4 only for now).
#
# Only what differs from espOS. espos_project_prologue() (CMakeLists.txt)
# puts espos/sdkconfig.d/espos.defaults and .esp32p4 first — task stacks,
# logging, HTTP server, core dump, signed OTA + rollback, the task watchdog,
# the C6 SDIO pinout and the hosted-transport tuning (block-ack window,
# streaming mode, mempool in PSRAM behind 64-byte L2 lines; espos/docs/wifi.md)
# — and selects the partition table from its PARTITIONS argument. Later files
# win: to override an espOS value, restate the key here; never copy the file.

# ---- Target: this firmware is for one board and no other.
# Without it, a build that starts from a fresh sdkconfig (deleted to change
# something, or a clean checkout) silently configures for plain esp32 -- IDF's
# default -- and fails much later with a missing esp_lcd_mipi_dsi.h, because
# the DSI half of esp_lcd only builds for a SoC that has the peripheral. The
# error names a header, not the target, so it reads as a missing dependency.
# IDF reads this key out of the defaults (tools/cmake/targets.cmake), so
# stating it here makes `idf.py build` correct with no -DIDF_TARGET at all.
CONFIG_IDF_TARGET="esp32p4"

# ---- Flash: 16 MB. The panel brings its own p4_16mb.csv (the esp-sr model
# partition sits at the offset 1.x flashed it to), so the size is stated here
# rather than inferred from a bundled espOS table.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# ---- Chip / memory: HEX PSRAM for the LVGL draw buffers, JPEG frames and
# the lwIP/WiFi pools
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ---- espOS: URI handler table; inbound stream frames — a subscription burst
# after a reconnect carries values + meta for every bound path at once
CONFIG_ESPOS_HTTPD_MAX_URI_HANDLERS=64
CONFIG_ESPOS_SK_RX_FRAME_MAX=65536

# ---- lwIP: the panel streams and serves layouts/screenshots
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_MAX_SOCKETS=16

# ---- LVGL runs on its own task with a big stack; C++ app
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=n

# ---- LVGL: configured by components/cockpit_hal/lv_conf.h (LV_CONF_PATH), not Kconfig
CONFIG_LV_CONF_SKIP=n
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n

# ---- esp-sr: on-device wake word "Hi ESP" (WakeNet 9) from the "model" partition
CONFIG_MODEL_IN_FLASH=y
CONFIG_AFE_INTERFACE_V1=y
CONFIG_SR_NSN_WEBRTC=y
CONFIG_SR_VADN_WEBRTC=y
CONFIG_SR_WN_WN9_HIESP=y
CONFIG_SR_MN_CN_NONE=y
CONFIG_SR_MN_EN_NONE=y

# ---- Internal RAM at boot is the scarce resource on the P4 (RETENT_RAM ~100 KiB
# after .data/.bss; esp_hosted allocates ~130 KiB before app_main and the main
# task must still find a home). Keep hosted's task stacks in PSRAM and a few
# IDF hot paths in flash instead of IRAM. Symptom otherwise:
# "assert failed: esp_startup_start_app app_startup.c:83 (res == pdTRUE)".
CONFIG_ESP_HOSTED_DFLT_TASK_FROM_SPIRAM=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH=y
CONFIG_RINGBUF_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_WIFI_RMT_IRAM_OPT=n
CONFIG_WIFI_RMT_RX_IRAM_OPT=n
CONFIG_WIFI_RMT_EXTRA_IRAM_OPT=n

# ---- N2K gateway: TWAI (legacy driver API kept from 1.x; migration to esp_twai pending)
CONFIG_TWAI_SUPPRESS_DEPRECATE_WARN=y
CONFIG_TWAI_ERRATA_FIX_LISTEN_ONLY_DOM=y

# ---- MIPI-DSI refresh must survive a disabled cache.
# The DPI stream is fed by a DMA ISR. With the ISR in flash (the default),
# every cache-disabling flash operation — an NVS commit from the layout
# store, a core-dump write, an OTA erase — stalls it, the DPI stream
# underruns and the whole panel blanks for an instant. Symptom: periodic
# full-screen flicker on any layout.
CONFIG_LCD_DSI_ISR_CACHE_SAFE=y

# ---- Internal RAM is the scarce pool at runtime too. Total heap reads ~30 MB
# but that is almost all PSRAM; espOS's lowMemory alarm restarts the panel
# below an 8 KB largest-free internal block, and in practice iram_big settled
# around 10 KB — roughly 2 KB of headroom, so any request needing a contiguous
# internal block could tip it. (The hosted transport's own pool is already in
# PSRAM: espOS pins that, see espos/sdkconfig.d/espos.defaults.esp32p4.)
#
# IDF's default sends every malloc() under 16 KB to internal RAM first. Lower
# it so ordinary allocations — including the 1-4 KB JsonDocument/string churn
# of every SK delta — prefer PSRAM and leave internal RAM to the DMA users
# (hosted transport, I2S, DSI). Anything that genuinely needs internal memory
# asks for it with MALLOC_CAP_INTERNAL and is unaffected, and the allocator
# still falls back to internal when PSRAM is full (Kconfig.spiram.common).
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=1024

# Enlarge the internal reserve (default 32 KB) that is prioritized for
# MALLOC_CAP_INTERNAL/DMA requests (hosted transport buffers, I2S/DSI DMA,
# task stacks): ordinary allocation pressure spills to PSRAM 64 KB earlier
# instead of starving the radio's DMA pool. Plain malloc() can still reach
# the reserve as a last resort once everything else is exhausted — this is
# a priority tier, not a hard floor.
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
